{
    "Visa Expiration Date": {
        "definition": "The visa expiration date is shown on the visa. This means the visa is valid, or can be used from the date it is issued until the date it expires, for travel for the same purpose, when the visa is issued for multiple entries. This time period from the visa issuance date to visa expiration date as shown on the visa, is called visa validity. If you travel frequently as a tourist for example, with a multiple entry visa, you do not have to apply for a new visa each time you want to travel to the U.S. As an example of travel for the same purpose, if you have a visitor visa, it cannot be used to enter at a later time to study in the U.S. The visa validity is the length of time you are permitted to travel to a port-of-entry in the United States to request permission of the U.S. immigration inspector to permit you to enter the U.S. The visa does not guarantee entry to the U.S. The Expiration Date for the visa should not be confused with the authorized length of your stay in the U.S., given to you by the U.S. immigration inspector at port-of-entry, on the Arrival-Departure Record, Form I-94, or I-94W for the Visa Waiver Program. The visa expiration date has nothing to do with the authorized length of your stay in the U.S. for any given visit. There are circumstances which can serve to void or cancel the period of time your visa is valid. If you overstay the end date of your authorized stay, as provided by the Department of Homeland Security's U.S. immigration officer at port of entry, or U. S. Citizenship and Immigration Services (USCIS), then this action on your part generally will automatically void or cancel your visa. However, if you have filed an application in a timely manner for extension of stay or a change of status, and that application is pending and not frivolous, and if you did not engage in unauthorized employment, then this normally does not automatically cancel your visa. If you have applied for adjustment of status to become a permanent resident alien (\"green card\" holder), you should contact USCIS regarding obtaining Advance Parole before leaving the U.S.",
        "references": {}
    }
}